fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СозданныеАкты</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСозданныеДокументы

Функция КонтрольЗаполненияФОрмы()
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Возврат Ложь;
		ОбщегоНазначения.СообщитьПользователю("Поле ""Месяц Отчета "" не заполнен");
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	СоздатьАктыАсинхронно();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура СоздатьАктыАсинхронно()
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Документы не будут созданы , если по договору были созданы документы вручную.|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не КонтрольЗаполненияФОрмы() Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьДлительнуюОперацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДлительнуюОперацию() Экспорт
	
	ДлительнаяОперация = ВыполнитьДлительнуюОперациюНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьДлительнуюОперациюНаСервере()
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
	"Обработки.ВКМ_МассовоеСозданиеАктов.ТяжелаяОперация", Объект.Период);
	Возврат ДлительнаяОперация;
	
КонецФункции 

&НаСервере
Процедура ОповещениеОЗавершении(Результат, ДполнительныеПарметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		Результат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			ЗаполнитьТаблицуОбработки(Результат);
		ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
			ОбщегоНазначения.СообщитьПользователю(Результат);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОбработки(МассивДанных)
	
	Объект.СозданныеАкты.Очистить();
	
	Для Каждого Стр Из МассивДанных Цикл
		НоваяСтрокаТЧ = Объект.СозданныеАкты.Добавить();
		НоваяСтрокаТЧ.Договор = Стр.Договор;
		НоваяСтрокаТЧ.Реализация = Стр.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
